lisp/orgmode.org
*** Narrow the agenda to a subtree
    =C-c C-x <= turns on the agenda restriction lock for the current
subtree.  This keeps your agenda focused on only this subtree.  Alarms
and notifications are still active outside the agenda restriction.
=C-c C-x >= turns off the agenda restriction lock returning your
agenda view back to normal.

I have added key bindings for the agenda to allow using =C-c C-x <= in
the agenda to set the restriction lock to the current task directly.
The following elisp accomplishes this.
#+header: :tangle yes
#+begin_src emacs-lisp
(add-hook 'org-agenda-mode-hook
          '(lambda () (org-defkey org-agenda-mode-map "\C-c\C-x<" 'bh/set-agenda-restriction-lock))
          'append)

(defun bh/set-agenda-restriction-lock (arg)
  "Set restriction lock to current task subtree or file if prefix is specified"
  (interactive "p")
  (let* ((pom (bh/get-pom-from-agenda-restriction-or-point))
         (tags (org-with-point-at pom (org-get-tags-at))))
    (let ((restriction-type (if (equal arg 4) 'file 'subtree)))
      (save-restriction
        (cond
         ((and (equal major-mode 'org-agenda-mode) pom)
          (org-with-point-at pom
            (org-agenda-set-restriction-lock restriction-type))
          (org-agenda-redo))
         ((and (equal major-mode 'org-mode) (org-before-first-heading-p))
          (org-agenda-set-restriction-lock 'file))
         (pom
          (org-with-point-at pom
            (org-agenda-set-restriction-lock restriction-type))))))))
#+end_src

This allows me to set the restriction lock from agenda to task directly.
I work from the agenda a lot and I find this very convenient.

Setting the restriction directly to the task is less surprising than
automatically moving up the tree to the project level task -- which is
what I was doing before.  If the select task is too restrictive it's
easy to move the restriction lock up a level by visiting the task in
the org file and going up and resetting the lock - in case you want to
see move of the project.

Selecting the entire project sometimes has too many tasks in it and I
want to limit the view to part of the subtree.  This is why I keep the =N= and
=U= key bindings for adjusting the narrowed region.

I've added new convenience keys for restricting the agenda and org-buffer to
subtree, parent task, and project task, as well as removing the restriction.
These keys work both in the agenda and as speed commands on a headline in the
org-file.

- =N= narrows to the current task subtree

  This is the same as same as =C-c C-x <=

- =U= narrows to the parent subtree of this task

  This goes up one level and narrows to that subtree.

- =P= narrows to the entire project containing this task

  This goes up the tree to the top-level =TODO= keyword and selects
  that as the subtree to narrow to

- =W= removes the restriction, widening the buffer

I like the highlighting for a restriction to only affect the headline
and not the entire body of the agenda restriction.  I use the
following setting to keep the highlight on the heading only (as was
the case for pre-8.0 versions of org-mode)

#+header: :tangle yes
#+begin_src emacs-lisp
;; Limit restriction lock highlighting to the headline only
(setq org-agenda-restriction-lock-highlight-subtree nil)
#+end_src
** org-ref
#+header: :tangle yes
#+begin_src emacs-lisp
(setq org-ref-bibliography-notes "~/ORG/notes.org"
      org-ref-default-bibliography '("~/ORG/references.bib")
      org-ref-pdf-directory "~/ORG/PAPERS/")
(setq bibtex-completion-bibliography "~/ORG/references.bib"
      bibtex-completion-library-path "~/ORG/PAPERS"
      bibtex-completion-notes-path "~/ORG/bibtex-notes")

(require-package 'org-ref)
#+end_src

#+RESULTS:
| [cl-struct-package-desc key-chord (20160227 438) map pairs of simultaneously pressed keys to commands nil single melpa nil ((:keywords keyboard chord input)) nil] | [cl-struct-package-desc hydra (20161117 1028) Make bindings that stick around. ((cl-lib (0 5))) tar melpa nil ((:url . https://github.com/abo-abo/hydra) (:keywords bindings)) nil] | [cl-struct-package-desc ivy (20161118 1213) Incremental Vertical completYon ((emacs (24 1))) tar melpa nil ((:url . https://github.com/abo-abo/swiper) (:keywords matching)) nil] | [cl-struct-package-desc biblio-core (20160901 1115) A framework for looking up and displaying bibliographic entries ((emacs (24 3)) (let-alist (1 0 4)) (seq (1 11)) (dash (2 12 1))) single melpa nil ((:url . http://github.com/cpitclaudel/biblio.el) (:keywords bib tex convenience hypermedia)) nil] | [cl-struct-package-desc biblio (20161014 1604) Browse and import bibliographic references from CrossRef, arXiv, DBLP, HAL, Dissemin, and doi.org ((emacs (24 3)) (biblio-core (0 2))) tar melpa nil nil nil] | [cl-struct-package-desc parsebib (20151006 232) A library for parsing bib files ((emacs (24 3))) single melpa nil ((:keywords text bibtex)) nil] | [cl-struct-package-desc helm-core (20161113 908) Development files for Helm ((emacs (24 4)) (async (1 9))) tar melpa nil ((:url . https://emacs-helm.github.io/helm/)) nil] | [cl-struct-package-desc helm (20161116 1211) Helm is an Emacs incremental and narrowing framework ((emacs (24 4)) (async (1 9)) (popup (0 5 3)) (helm-core (2 3 2))) tar melpa nil ((:url . https://emacs-helm.github.io/helm/)) nil] | [cl-struct-package-desc helm-bibtex (20161119 412) A bibliography manager based on Helm ((helm (1 5 5)) (parsebib (1 0)) (s (1 9 0)) (dash (2 6 0)) (f (0 16 2)) (cl-lib (0 5)) (biblio (0 2))) tar melpa nil nil nil] | [cl-struct-package-desc org-ref (20161117 630) citations, cross-references and bibliographies in org-mode ((dash (2 11 0)) (helm (1 5 5)) (helm-bibtex (2 0 0)) (ivy (0 8 0)) (hydra (0 13 2)) (key-chord (0)) (s (1 10 0)) (f (0 18 0)) (emacs (24 4))) tar melpa nil ((:url . https://github.com/jkitchin/org-ref) (:keywords org-mode cite ref label)) nil] |

* Launch
#+header: :tangle yes
#+begin_src emacs-lisp
(provide 'init-org)
#+end_src
