lisp/orgmode.el

(defun bh/set-agenda-restriction-lock (arg)
  "Set restriction lock to current task subtree or file if prefix is specified"
  (interactive "p")
  (let* ((pom (bh/get-pom-from-agenda-restriction-or-point))
         (tags (org-with-point-at pom (org-get-tags-at))))
    (let ((restriction-type (if (equal arg 4) 'file 'subtree)))
      (save-restriction
        (cond
         ((and (equal major-mode 'org-agenda-mode) pom)
          (org-with-point-at pom
            (org-agenda-set-restriction-lock restriction-type))
          (org-agenda-redo))
         ((and (equal major-mode 'org-mode) (org-before-first-heading-p))
          (org-agenda-set-restriction-lock 'file))
         (pom
          (org-with-point-at pom
            (org-agenda-set-restriction-lock restriction-type))))))))

;; Limit restriction lock highlighting to the headline only
(setq org-agenda-restriction-lock-highlight-subtree nil)

(setq org-ref-bibliography-notes "~/ORG/notes.org"
      org-ref-default-bibliography '("~/ORG/references.bib")
      org-ref-pdf-directory "~/ORG/PAPERS/")
(setq bibtex-completion-bibliography "~/ORG/references.bib"
      bibtex-completion-library-path "~/ORG/PAPERS"
      bibtex-completion-notes-path "~/ORG/bibtex-notes")

(require-package 'org-ref)

(provide 'init-org)
